package stepiktasks.course2

/**
 * Необходимо разработать программу для поиска среднего и медианного значений списка действительных чисел со знаком,
 * подаваемого на вход программы. Медианным значением считается такое число выборки, что ровно половина из элементов
 * выборки больше него, а другая половина меньше него. Если в выборке чётное число элементов, медиана вычисляется как
 * полусумма двух центральных элементов в упорядоченной выборке.
 *
 * Вход: список с n элементами.
 *
 * Выход: два значения (среднее, медиана)
 *
 * Sample Input 1:
 * 1.0 2.0 3.0 4.0
 *
 * Sample Output 1:
 * 2.5 2.5
 *
 * Sample Input 2:
 * 1.5 2.5 3.5 5.5
 *
 * Sample Output 2:
 * 3.25 3.0
 */
fun main(args: Array<String>) {

}